app/views/home/index.html.erb

  current_user.estado = "activo"
  current_user.save
---
UPDATE "users" SET "estado" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["estado", "inactivo"], ["updated_at", "2019-03-31 16:14:33.109695"], ["id", 2]]