app/views/llamadaslibres/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
          <td><strong>Llamada de :</strong></td>
          <% @userR = User.find(llamadaslibrer.idEmisor )%>