app/views/llamadaslibres/show.html.erb


    <% @llamada = Llamadaslibre.find(@llamadaslibre.id)%>
---
SELECT  "llamadaslibres".* FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    <% if @llamada.estado == "rechazado" %>
     <% @sala =  Sala.find(@llamada.idSala)%>
     <% @sala.estado = "libre" %>
     <% @sala.save %>
      <% Llamadaslibre.destroy(@llamadaslibre.id) %>
---
SELECT  "salas".* FROM "salas" WHERE "salas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "salas" SET "estado" = ?, "updated_at" = ? WHERE "salas"."id" = ?  [["estado", "libre"], ["updated_at", "2019-04-01 01:26:50.873086"], ["id", 2]]
DELETE FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ?  [["id", 15]]