app/controllers/llamadaslibres_controller.rb

SELECT  "llamadaslibres".* FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "llamadaslibres" SET "estado" = ?, "updated_at" = ? WHERE "llamadaslibres"."id" = ?  [["estado", "rechazado"], ["updated_at", "2019-04-01 00:07:39.002544"], ["id", 1]]
---
def rechazar

  @llamada = Llamadaslibre.find(params[:idllamada])
  @llamada.estado = "rechazado"
  @llamada.save

SELECT  "llamadaslibres".* FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "llamadaslibres" SET "estado" = ?, "updated_at" = ? WHERE "llamadaslibres"."id" = ?  [["estado", "conectado"], ["updated_at", "2019-04-01 00:58:29.245986"], ["id", 8]]
---
def contestar
  @llamada = Llamadaslibre.find(params[:idllamada])
  @llamada.estado = "conectado"
  @llamada.save

SELECT  "llamadaslibres".* FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "salas".* FROM "salas" WHERE "salas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "salas" SET "estado" = ?, "updated_at" = ? WHERE "salas"."id" = ?  [["estado", "libre"], ["updated_at", "2019-04-01 01:48:24.298784"], ["id", 1]]
DELETE FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ?  [["id", 1]]
---
def colgar
  @llamada = Llamadaslibre.find(params[:idllamada])
  @sala = Sala.find(@llamada.idSala)
  @sala.estado = "libre"
  @sala.save
  @llamada.destroy

SELECT "llamadaslibres".* FROM "llamadaslibres" WHERE (idReceptor = 5)
---
  def index
    if (Llamadaslibre.exists?(idReceptor: current_user.id))

SELECT  "llamadaslibres".* FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ?  [["id", 1]]
SELECT  "salas".* FROM "salas" WHERE "salas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "salas" SET "estado" = ?, "updated_at" = ? WHERE "salas"."id" = ?  [["estado", "libre"], ["updated_at", "2019-04-01 00:24:29.184902"], ["id", 2]]
DELETE FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ?  [["id", 2]]
---
  def show
    if Llamadaslibre.exists?(id: params[:id])
        @llamada = Llamadaslibre.find(@llamadaslibre.id)
      if @llamada.estado == "conectado"
          @idSala = @llamada.idSala
          @llamada.destroy
          redirect_to "/salas/" + @idSala
      end
      if @llamada.estado == "rechazado"
        @sala =  Sala.find(@llamada.idSala)
        @sala.estado = "libre"
        @sala.save
        Llamadaslibre.destroy(@llamadaslibre.id)

UPDATE "llamadaslibres" SET "estado" = ?, "updated_at" = ? WHERE "llamadaslibres"."id" = ?  [["estado", "aceptado"], ["updated_at", "2019-03-31 21:35:01.978786"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @llamadaslibre.update(llamadaslibre_params)

DELETE FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ?  [["id", 2]]
---
  def destroy
    @llamadaslibre.destroy

SELECT  "llamadaslibres".* FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_llamadaslibre
      if (Llamadaslibre.exists?(id: params[:id]))
        @llamadaslibre = Llamadaslibre.find(params[:id])