app/controllers/llamadaslibres_controller.rb

SELECT  "llamadaslibres".* FROM "llamadaslibres" WHERE "llamadaslibres"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_llamadaslibre
      if (Llamadaslibre.exists?(id: params[:id]))
        @llamadaslibre = Llamadaslibre.find(params[:id])