app/controllers/salas_controller.rb

SELECT "salas".* FROM "salas"
---
  def index
    @salas = Sala.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @sala.estado = "ocuapado"
    @sala.cadena ||= ''
    @sala.cadena = @sala.cadena.remove("%" + (current_user.id).to_s)
    @sala.cadena = @sala.cadena + "%" + (current_user.id).to_s
    @sala.save

    @user = User.find(current_user.id)

INSERT INTO "salas" ("nombre", "apikey", "sessionID", "token", "minutos", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sala = Sala.new(sala_params)
    @sala.estado = "ocupado"
    respond_to do |format|
      if @sala.save

DELETE FROM "salas" WHERE "salas"."id" = ?  [["id", 3]]
---
  def destroy
    @sala.destroy

SELECT  "salas".* FROM "salas" WHERE "salas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_sala
      @sala = Sala.find(params[:id])