app/controllers/users_controller.rb

  def logout
    current_user.estado = "inactivo"
    current_user.save
---
UPDATE "users" SET "estado" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["estado", "inactivo"], ["updated_at", "2019-03-31 17:26:32.363339"], ["id", 2]]

  def crearllamada
    @salas = Sala.where("estado = ?", "libre")
    if (@salas.count > 0)
      @llamada = Llamadaslibre.new
      @llamada.idEmisor = current_user.id
      @llamada.idReceptor = params[:idemisor]
      @llamada.estado = "espera"
      @sala  = @salas.order("minutos DESC").first
      @sala.estado = "ocupado"
      @sala.save
      @llamada.idSala = (@sala.id).to_s
      @llamada.save
---
SELECT  "salas".* FROM "salas" WHERE (estado = 'libre') ORDER BY minutos DESC LIMIT ?  [["LIMIT", 1]]
SELECT "salas".* FROM "salas" WHERE (estado = 'libre')
SELECT COUNT(*) FROM "salas" WHERE (estado = 'libre')
UPDATE "salas" SET "estado" = ?, "updated_at" = ? WHERE "salas"."id" = ?  [["estado", "ocupado"], ["updated_at", "2019-03-31 20:58:52.726350"], ["id", 1]]
INSERT INTO "llamadaslibres" ("idEmisor", "idReceptor", "idSala", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["idEmisor", "2"], ["idReceptor", "3"], ["idSala", "1"], ["estado", "espera"], ["created_at", "2019-03-31 20:58:52.735395"], ["updated_at", "2019-03-31 20:58:52.735395"]]